# Этап 1: Сборка приложения
FROM golang:1.24 AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для загрузки зависимостей
COPY go.mod go.sum ./

# Загружаем зависимости
RUN go mod download

# Копируем весь исходный код
COPY . .

# Компилируем приложение
# Флаг -o app задаёт имя выходного бинарного файла
RUN CGO_ENABLED=0 GOOS=linux go build -o app cmd/app/main.go

# Этап 2: Создание минимального образа для запуска
FROM alpine:latest

# Устанавливаем рабочую директорию
WORKDIR /root/

# Копируем скомпилированный бинарник из этапа сборки
COPY --from=builder /app/app .

# Указываем порт (если приложение использует, например, 8080)
EXPOSE 8080

# Команда для запуска приложения
CMD ["./app"]